<a href="https://colab.research.google.com/github/macscheffer/DS-Unit-1-Sprint-4-Statistical-Tests-and-Experiments/blob/master/DS_Unit_1_Sprint_Challenge_4_Mac_Scheffer.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Science Unit 1 Sprint Challenge 4

## Exploring Data, Testing Hypotheses

In this sprint challenge you will look at a dataset of people being approved or rejected for credit.

https://archive.ics.uci.edu/ml/datasets/Credit+Approval

Data Set Information: This file concerns credit card applications. All attribute names and values have been changed to meaningless symbols to protect confidentiality of the data. This dataset is interesting because there is a good mix of attributes -- continuous, nominal with small numbers of values, and nominal with larger numbers of values. There are also a few missing values.

Attribute Information:
- A1: b, a.
- A2: continuous.
- A3: continuous.
- A4: u, y, l, t.
- A5: g, p, gg.
- A6: c, d, cc, i, j, k, m, r, q, w, x, e, aa, ff.
- A7: v, h, bb, j, n, z, dd, ff, o.
- A8: continuous.
- A9: t, f.
- A10: t, f.
- A11: continuous.
- A12: t, f.
- A13: g, p, s.
- A14: continuous.
- A15: continuous.
- A16: +,- (class attribute)

Yes, most of that doesn't mean anything. A16 (the class attribute) is the most interesting, as it separates the 307 approved cases from the 383 rejected cases. The remaining variables have been obfuscated for privacy - a challenge you may have to deal with in your data science career.

Sprint challenges are evaluated based on satisfactory completion of each part. It is suggested you work through it in order, getting each aspect reasonably working, before trying to deeply explore, iterate, or refine any given step. Once you get to the end, if you want to go back and improve things, go for it!

## Part 1 - Load and validate the data

- Load the data as a `pandas` data frame.
- Validate that it has the appropriate number of observations (you can check the raw file, and also read the dataset description from UCI).
- UCI says there should be missing data - check, and if necessary change the data so pandas recognizes it as na
- Make sure that the loaded features are of the types described above (continuous values should be treated as float), and correct as necessary

This is review, but skills that you'll use at the start of any data exploration. Further, you may have to do some investigation to figure out which file to load from - that is part of the puzzle.

In [251]:
# TODO

import numpy as np
import pandas as pd

df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/credit-screening/crx.data',
                 names = ['A'+str(i) for i in range(1,17)])
df.shape

(690, 16)

In [252]:
df.head(2)

  A1     A2    A3 A4 A5 A6 A7    A8 A9 A10  A11 A12 A13    A14  A15 A16
0  b  30.83  0.00  u  g  w  v  1.25  t   t    1   f   g  00202    0   +
1  a  58.67  4.46  u  g  q  h  3.04  t   t    6   f   g  00043  560   +

In [253]:
# notice A2 is supposed to be continuous, must be nans
df.describe()

               A3          A8        A11            A15
count  690.000000  690.000000  690.00000     690.000000
mean     4.758725    2.223406    2.40000    1017.385507
std      4.978163    3.346513    4.86294    5210.102598
min      0.000000    0.000000    0.00000       0.000000
25%      1.000000    0.165000    0.00000       0.000000
50%      2.750000    1.000000    0.00000       5.000000
75%      7.207500    2.625000    3.00000     395.500000
max     28.000000   28.500000   67.00000  100000.000000

In [254]:
# A1 has 3 uniques, they are using ? marks as NaN values.

df.describe(exclude=np.number)

         A1   A2   A4   A5   A6   A7   A9  A10  A12  A13    A14  A16
count   690  690  690  690  690  690  690  690  690  690    690  690
unique    3  350    4    4   15   10    2    2    2    3    171    2
top       b    ?    u    g    c    v    t    f    f    g  00000    -
freq    468   12  519  519  137  399  361  395  374  625    132  383

In [255]:
df.isnull().sum().sum()

0

**Now we have found all of the null values mentioned in
[the corresponding data dictionary](https://archive.ics.uci.edu/ml/machine-learning-databases/credit-screening/crx.names) **

In [256]:

df[df == '?'].describe(exclude=np.number)

        A1  A2 A4 A5 A6 A7   A9  A10  A12  A13 A14  A16
count   12  12  6  6  9  9  0.0  0.0  0.0  0.0  13  0.0
unique   1   1  1  1  1  1  0.0  0.0  0.0  0.0   1  0.0
top      ?   ?  ?  ?  ?  ?  NaN  NaN  NaN  NaN   ?  NaN
freq    12  12  6  6  9  9  NaN  NaN  NaN  NaN  13  NaN

In [257]:
# double checking

df.describe(exclude=np.number)

         A1   A2   A4   A5   A6   A7   A9  A10  A12  A13    A14  A16
count   690  690  690  690  690  690  690  690  690  690    690  690
unique    3  350    4    4   15   10    2    2    2    3    171    2
top       b    ?    u    g    c    v    t    f    f    g  00000    -
freq    468   12  519  519  137  399  361  395  374  625    132  383

In [258]:
# looks good, we dont have full counts for every column but since we don't have any intuitions on the data..
# it makes sense get a little more familiar with the columns. then we can examine the effects of various methods to handling them.

df = df.replace('?', np.NaN)
df.describe(exclude=np.number)

         A1     A2   A4   A5   A6   A7   A9  A10  A12  A13    A14  A16
count   678    678  684  684  681  681  690  690  690  690    677  690
unique    2    349    3    3   14    9    2    2    2    3    170    2
top       b  22.67    u    g    c    v    t    f    f    g  00000    -
freq    468      9  519  519  137  399  361  395  374  625    132  383

In [259]:
df.isna().sum().sum()

67

In [260]:
df.head()

  A1     A2     A3 A4 A5 A6 A7    A8 A9 A10  A11 A12 A13    A14  A15 A16
0  b  30.83  0.000  u  g  w  v  1.25  t   t    1   f   g  00202    0   +
1  a  58.67  4.460  u  g  q  h  3.04  t   t    6   f   g  00043  560   +
2  a  24.50  0.500  u  g  q  h  1.50  t   f    0   f   g  00280  824   +
3  b  27.83  1.540  u  g  w  v  3.75  t   t    5   t   g  00100    3   +
4  b  20.17  5.625  u  g  w  v  1.71  t   f    0   f   s  00120    0   +

In [261]:
# more checks

# note there are still missing values but still don't want to make the dataset less accurate by just picking a way to handle them without investigating.


# A1 we adjust below to make intuitive to use by making a=1 and b=0. 
# A2 needs to be treated as a continuous variable, but has 12 missing values so object type is being returned for now.
# same story as the above for A4, A5 [broken into a few categories]

# A6 and A7 aswell. [these are classified over a broad range of categories.]

# A14 same story will go through one by one now.

df.A1 = df.A1.map({'a': 1, 'b': 0})

df.dtypes, df.A1.unique()

(A1     float64
 A2      object
 A3     float64
 A4      object
 A5      object
 A6      object
 A7      object
 A8     float64
 A9      object
 A10     object
 A11      int64
 A12     object
 A13     object
 A14     object
 A15      int64
 A16     object
 dtype: object, array([ 0.,  1., nan]))

In [262]:
df.A16 = df.A16.map({'+': 1, '-': 0})
df.A16.mean()

0.4449275362318841

In [263]:
df.A16.unique()

array([1, 0])

In [264]:
# need to handle these now taking a lil longer than i thought.

# nan_non_continuous= ['A1', 'A4', 'A5', 'A6', 'A7']
# nan_continuous = ['A2', 'A14']
df.shape

(690, 16)

In [265]:
# we are going to drop all of A1 based on the fact that there wasn't any easily observable difference in chance of '+' in A16

df.pivot_table(index='A4', values='A16')

         A16
A4
l   1.000000
u   0.493256
y   0.276074

In [266]:
df.A4.value_counts()

u    519
y    163
l      2
Name: A4, dtype: int64

In [267]:
df.A4.value_counts(), df.A5.value_counts()

(u    519
 y    163
 l      2
 Name: A4, dtype: int64, g     519
 p     163
 gg      2
 Name: A5, dtype: int64)

In [0]:
df.A4 = df.A4.fillna('u')
df.A5 = df.A5.fillna('g')

In [269]:
df.A4.value_counts(), df.A5.value_counts()# good here both 690 sorry its so sloppy hopefully i have time to come back

(u    525
 y    163
 l      2
 Name: A4, dtype: int64, g     525
 p     163
 gg      2
 Name: A5, dtype: int64)

In [0]:
# filling the na's seem okay at quick glance because seems like they have similar effect on A16 probability

import random
# will come back to explain logic and why this is okay later. 
# had malware attack again and am way behind now

df.A1 = df.A1.fillna(random.randint(0,1))

In [271]:
df.A1.value_counts()

0.0    468
1.0    222
Name: A1, dtype: int64

In [272]:
df.isna().sum()

A1      0
A2     12
A3      0
A4      0
A5      0
A6      9
A7      9
A8      0
A9      0
A10     0
A11     0
A12     0
A13     0
A14    13
A15     0
A16     0
dtype: int64

In [273]:
df.isna().sum().sum()

43

In [277]:
df.A7.value_counts(),

(v     399
 h     138
 bb     59
 ff     57
 z       8
 j       8
 dd      6
 n       4
 o       2
 Name: A7, dtype: int64,)

In [0]:
df.A6 = df.A6.fillna('c')
df.A7 = df.A7.fillna('v')

In [283]:
df.dtypes

A1     float64
A2      object
A3     float64
A4      object
A5      object
A6      object
A7      object
A8     float64
A9      object
A10     object
A11      int64
A12     object
A13     object
A14     object
A15      int64
A16      int64
dtype: object

In [288]:
pd.to_numeric(df.A2.dropna()).sum()

21403.22

In [289]:
len(pd.to_numeric(df.A2.dropna()))

678

In [0]:
A2_mean = pd.to_numeric(df.A2.dropna()).sum() / len(pd.to_numeric(df.A2.dropna()))

In [0]:
df.A2 = pd.to_numeric(df.A2.fillna(A2_mean))

In [0]:
A14_mean = pd.to_numeric(df.A14.dropna()).sum() / len(pd.to_numeric(df.A2.dropna()))

In [0]:
df.A14 = pd.to_numeric(df.A2.fillna(A14_mean))

In [302]:
df.isna().sum().sum()

0

In [304]:
df.describe(exclude=np.number)

         A4   A5   A6   A7   A9  A10  A12  A13
count   690  690  690  690  690  690  690  690
unique    3    3   14    9    2    2    2    3
top       u    g    c    v    t    f    f    g
freq    525  525  146  408  361  395  374  625

In [305]:
df.describe(include=np.number)

,A1,A2,A3,A8,A11,A14,A15,A16
count,690.000000,690.000000,690.000000,690.000000,690.00000,690.000000,690.000000,690.000000
mean,0.321739,31.568171,4.758725,2.223406,2.40000,31.568171,1017.385507,0.444928
std,0.467482,11.853273,4.978163,3.346513,4.86294,11.853273,5210.102598,0.497318
min,0.000000,13.750000,0.000000,0.000000,0.00000,13.750000,0.000000,0.000000
25%,0.000000,22.670000,1.000000,0.165000,0.00000,22.670000,0.000000,0.000000
50%,0.000000,28.625000,2.750000,1.000000,0.00000,28.625000,5.000000,0.000000
75%,1.000000,37.707500,7.207500,2.625000,3.00000,37.707500,395.500000,1.000000
max,1.000000,80.250000,28.000000,28.500000,67.00000,80.250000,100000.000000,1.000000

In [306]:
df.shape

(690, 16)

## Part 2 - Exploring data, Testing hypotheses

The only thing we really know about this data is that A16 is the class label. Besides that, we have 6 continuous (float) features and 9 categorical features.

Explore the data: you can use whatever approach (tables, utility functions, visualizations) to get an impression of the distributions and relationships of the variables. In general, your goal is to understand how the features are different when grouped by the two class labels (`+` and `-`).

For the 6 continuous features, how are they different when split between the two class labels? Choose two features to run t-tests (again split by class label) - specifically, select one feature that is *extremely* different between the classes, and another feature that is notably less different (though perhaps still "statistically significantly" different). You may have to explore more than two features to do this.

For the categorical features, explore by creating "cross tabs" (aka [contingency tables](https://en.wikipedia.org/wiki/Contingency_table)) between them and the class label, and apply the Chi-squared test to them. [pandas.crosstab](http://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.crosstab.html) can create contingency tables, and [scipy.stats.chi2_contingency](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.chi2_contingency.html) can calculate the Chi-squared statistic for them.

There are 9 categorical features - as with the t-test, try to find one where the Chi-squared test returns an extreme result (rejecting the null that the data are independent), and one where it is less extreme.

**NOTE** - "less extreme" just means smaller test statistic/larger p-value. Even the least extreme differences may be strongly statistically significant.

Your *main* goal is the hypothesis tests, so don't spend too much time on the exploration/visualization piece. That is just a means to an end - use simple visualizations, such as boxplots or a scatter matrix (both built in to pandas), to get a feel for the overall distribution of the variables.

This is challenging, so manage your time and aim for a baseline of at least running two t-tests and two Chi-squared tests before polishing. And don't forget to answer the questions in part 3, even if your results in this part aren't what you want them to be.

In [309]:
df.dtypes

A1     float64
A2     float64
A3     float64
A4      object
A5      object
A6      object
A7      object
A8     float64
A9      object
A10     object
A11      int64
A12     object
A13     object
A14    float64
A15      int64
A16      int64
dtype: object

In [0]:
# TODO
# A1 to int
# A11 to float
df.A1 = df.A1.astype(int)

In [0]:
df.A11 = df.A11.astype(float)

In [0]:
df.A15 = df.A15.astype(float)

In [317]:
# finally squared away...
df.dtypes

A1       int64
A2     float64
A3     float64
A4      object
A5      object
A6      object
A7      object
A8     float64
A9      object
A10     object
A11    float64
A12     object
A13     object
A14    float64
A15    float64
A16      int64
dtype: object

In [319]:
df[['A2', 'A3', 'A8', 'A11', 'A14','A15','A16']].corr()

           A2        A3        A8       A11       A14       A15       A16
A2   1.000000  0.201316  0.392787  0.185575  1.000000  0.018539  0.161627
A3   0.201316  1.000000  0.298902  0.271207  0.201316  0.123121  0.206294
A8   0.392787  0.298902  1.000000  0.322330  0.392787  0.051345  0.322475
A11  0.185575  0.271207  0.322330  1.000000  0.185575  0.063692  0.406410
A14  1.000000  0.201316  0.392787  0.185575  1.000000  0.018539  0.161627
A15  0.018539  0.123121  0.051345  0.063692  0.018539  1.000000  0.175657
A16  0.161627  0.206294  0.322475  0.406410  0.161627  0.175657  1.000000

In [0]:
cont = ['A2', 'A3', 'A8', 'A11', 'A14','A15']

pos_df = df[df.A16 == 1]
neg_df = df[df.A16 == 0]

import scipy.stats

In [328]:
# lets look at the change in correlations now when filtering for +,- A16

pos_df[['A2', 'A3', 'A8', 'A11', 'A14','A15']].corr()

           A2        A3        A8       A11       A14       A15
A2   1.000000  0.241398  0.447014  0.188662  1.000000 -0.011464
A3   0.241398  1.000000  0.379640  0.270734  0.241398  0.110576
A8   0.447014  0.379640  1.000000  0.268358  0.447014 -0.001367
A11  0.188662  0.270734  0.268358  1.000000  0.188662 -0.009422
A14  1.000000  0.241398  0.447014  0.188662  1.000000 -0.011464
A15 -0.011464  0.110576 -0.001367 -0.009422 -0.011464  1.000000

In [331]:
neg_df[['A2', 'A3', 'A8', 'A11', 'A14','A15']].corr() #correlations between the continuous variables are significantly different when filtering by +/-

           A2        A3        A8       A11       A14       A15
A2   1.000000  0.093411  0.242029  0.013084  1.000000 -0.027522
A3   0.093411  1.000000  0.013675  0.082698  0.093411  0.120923
A8   0.242029  0.013675  1.000000  0.003884  0.242029 -0.092774
A11  0.013084  0.082698  0.003884  1.000000  0.013084  0.010720
A14  1.000000  0.093411  0.242029  0.013084  1.000000 -0.027522
A15 -0.027522  0.120923 -0.092774  0.010720 -0.027522  1.000000

In [0]:
summary_cont = {}
for col in cont:
  t, p = scipy.stats.ttest_ind(pos_df[col], neg_df[col])
  mean_pos = pos_df[col].mean()
  mean_neg = neg_df[col].mean()
  dif_in_means = mean_pos - mean_neg
  median_pos = pos_df[col].median()
  median_neg = neg_df[col].median()
  dif_in_median = median_pos - median_neg
  std_pos = pos_df[col].std()
  std_neg = neg_df[col].std()
  dif_in_std = std_pos - std_neg
  summary_cont[col] = [t, p, mean_pos, mean_neg, dif_in_means, std_pos, std_neg, dif_in_std, median_pos, median_neg, dif_in_median]
  

summary_cont = pd.DataFrame(summary_cont).T
summary_cont = summary_cont.rename({0:'t_stat', 1:'p_value',
                     2:'mean_pos', 3:'mean_neg',
                     4:'dif_in_means', 5:'std_pos',
                     6:'std_neg', 7:'dif_in_std',
                     8:'median_pos', 9:'median_neg', 10:'dif_in_median'}, axis='columns')

In [353]:
summary_cont # notice that the positive has a higher mean, median, standard deviation that the negative side
             # this tells us there are not only higher positive outliers in the pos_filtered data but that even the median was higher,
              #so we can say that all of these variables are positively correlated with the + column

,t_stat,p_value,mean_pos,mean_neg,dif_in_means,std_pos,std_neg,dif_in_std,median_pos,median_neg,dif_in_median
A11,11.667004,7.957719e-29,4.605863,0.631854,3.974009,6.320242,1.900049,4.420193,3.00,0.000,3.000
A14,4.295930,1.990220e-05,33.706470,29.854182,3.852288,12.768888,10.779084,1.989804,30.67,27.670,3.000
A15,4.680216,3.452026e-06,2038.859935,198.605744,1840.254191,7659.763941,671.608839,6988.155102,221.00,1.000,220.000
A2,4.295930,1.990220e-05,33.706470,29.854182,3.852288,12.768888,10.779084,1.989804,30.67,27.670,3.000
A3,5.529983,4.551681e-08,5.904951,3.839948,2.065003,5.471485,4.337662,1.133823,4.46,2.210,2.250
A8,8.935820,3.671054e-18,3.427899,1.257924,2.169975,4.120792,2.120481,2.000312,2.00,0.415,1.585

In [355]:
pd.crosstab(index=df.A4, columns=df.A5) # notice we can get rid of one of these columns all together they are the same.

A5    g  gg    p
A4
l     0   2    0
u   525   0    0
y     0   0  163

In [356]:
pd.crosstab(index=pos_df.A4, columns=pos_df.A5)

A5    g  gg   p
A4
l     0   2   0
u   260   0   0
y     0   0  45

In [357]:
pd.crosstab(index=neg_df.A4, columns=neg_df.A5) # see we can see that these columns are doing the same thing for us regardless of the filter.

A5    g    p
A4
u   265    0
y     0  118

In [364]:
scipy.stats.chisquare(pd.crosstab(index=neg_df.A4, columns=neg_df.A5))

Power_divergenceResult(statistic=array([265., 118.]), pvalue=array([1.39532253e-59, 1.73388010e-27]))

In [366]:
scipy.stats.chisquare(pd.crosstab(index=pos_df.A4, columns=pos_df.A5))

Power_divergenceResult(statistic=array([520.,   4.,  90.]), pvalue=array([1.21181048e-113, 1.35335283e-001, 2.86251858e-020]))

In [374]:
categorical_cols = ['A1', 'A4', 'A5', 'A6','A7','A9','A10','A12','A13']
# lets see if A4 is different with other columns. which is the same as asking whether A5 is aswell
categorical_summary = {}
for col in categorical_cols:
  ts_pos, ps_pos = scipy.stats.chisquare(pd.crosstab(index=pos_df.A4, columns=pos_df[col]))
  ts_neg, ps_neg = scipy.stats.chisquare(pd.crosstab(index=neg_df.A4, columns=neg_df[col]))
  
  print(ps_pos)

[4.01390524e-52 1.13548258e-30]
[1.35335283e-001 1.21181048e-113 2.86251858e-020]
[1.21181048e-113 1.35335283e-001 2.86251858e-020]
[1.09622541e-05 1.90398028e-17 1.07880415e-08 1.56118045e-01
 1.42361230e-04 1.19315225e-02 1.34802391e-05 3.67879441e-01
 9.79399011e-04 2.14454083e-05 3.38618867e-19 1.35335283e-01
 3.66898051e-07 3.97297759e-09]
[3.31380028e-07 1.35335283e-01 4.63091873e-03 4.94862660e-25
 3.67879441e-01 1.35335283e-01 3.67879441e-01 3.58692676e-46
 3.01973834e-02]
[1.74746551e-04 2.32703517e-78]
[1.02089698e-23 5.93430638e-59]
[7.74266989e-51 1.40530902e-32]
[1.17658110e-78 7.42735782e-02 3.69786372e-03]

print(p)

## Part 3 - Analysis and Interpretation

Now that you've looked at the data, answer the following questions:

- Interpret and explain the two t-tests you ran - what do they tell you about the relationships between the continuous features you selected and the class labels?
- Interpret and explain the two Chi-squared tests you ran - what do they tell you about the relationships between the categorical features you selected and the class labels?
- What was the most challenging part of this sprint challenge?

Answer with text, but feel free to intersperse example code/results or refer to it from earlier.

*i commented within the code for the ttests but essentially that the cont variables we were given were pos correlated with + outcome, this means they are most likely a linear combination of each other and we'll know how to handle that better in a few weeks for forecasting*

*that two of the features we're exactly the same while there we're non-linear relationships within others*

*i had another malware attack and essentially had to play catch up causing me to be frantic and not think straight, i think that lower level 'nity-grity' statistics are a great foundation but would love to be able to catch subtletys more easily*

*i should have had my computer better prepared. but am looking forward to looking over this challenge after i've eaten to get into everything a little deeper. i don't want to build my statistics house on top of bad plumming. thanks for reviewing this and looking forward to talking about it. *